import cv2

img = cv2.imread('../img/blank_500.jpg')

# 맨마지막에 아무 숫자도 안 적혀 있으면 기본 디폴트 숫자로 1을 의미.

cv2.line(img, (50, 50), (150, 50), (255, 0, 0))
# 파란색 1픽셀 선
# 앞에 2개가 위치 자표, 255 0 0 == BLUE

cv2.line(img, (200, 50), (300, 50), (0, 255, 0))
# 초록색 1픽셀 선
# 앞에 2개가 위치 자표, 0 255 0 == GREEN

cv2.line(img, (350, 50), (450, 50), (0, 0, 255))
# 빨간색 1픽셀 선
# 앞에 2개가 위치 자표, 0 0 255 == RED


# 맨마지막 10이 10픽셀을 의미한다.

cv2.line(img, (100, 100), (400, 100), (255, 255, 0), 10)
# 하늘색 10픽셀 선

cv2.line(img, (100, 150), (400, 150), (255, 0, 255), 10)
# 분홍색 10픽셀 선

cv2.line(img, (100, 200), (400, 200), (0, 255, 255), 10)
# 노랑색 10픽셀 선

cv2.line(img, (100, 250), (400, 250), (200, 200, 200), 10)
# 회색 10픽셀 선

cv2.line(img, (100, 300), (400, 300), (0, 0, 0), 10)
# 검은색 10픽셀 선


# 4연결 선
cv2.line(img, (100, 350), (400, 400), (0, 0, 255), 20, cv2.LINE_4)

# 8연결 선
cv2.line(img, (100, 400), (400, 450), (0, 0, 255), 20, cv2.LINE_8)

# 안티에일리어싱 선
cv2.line(img, (100, 450), (400, 500), (0, 0, 255), 20, cv2.LINE_AA)

# 이미지 전체에 대각선
cv2.line(img, (0, 0), (500, 500), (0, 0, 255))



# 이미지 보여주기
cv2.imshow('img_lines', img)
cv2.waitKey(0)
cv2.destroyAllWindows()


